%计算BPSK信号的功率谱，并画出相应分析图
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
tic
clc
clear all;
%%%%%%%%%%%%%%%仿真参数设置%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
fc=300;%载波频率
fs=6400;%采样频率
fd=100;%码率
t0=0;%起始时间
t1=0.32;%终止时间
t=[t0:1/fs:t1-1/fs];
%%%%%%%%%%%%%%%%调制信号I的生成%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
d=randint(1,fd*t1);%随机产生包含10个符号的基带信号
N1=length(d);
for k=1:N1,
    I((k-1)*fs/fd+1:k*fs/fd)=d(k); 
end
%%%%%%%计算BPSK信号的频谱图并绘出%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
s=I.*cos(2*pi*fc.*t);
N=length(s);
M=32;
cyclic_spectrum(s, N, fs, M)